BookerChang/rtbus/boards.txt
RAK4631.name=RAK4631 RTDuo

RAK4631.build.board=RAK4631
RAK4631.build.core=rak4631
RAK4631.build.variant=RAK5005O
RAK4631.build.mcu=cortex-m4
RAK4631.build.f_cpu=64000000L
RAK4631.build.arch=NRF52
RAK4631.upload.tool=ymodem_upload
RAK4631.upload.speed=115200
RAK4631.program.tool=ymodem_upload
RAK4631.program.speed=115200
RAK4631.bootloader.tool=rtduo_vscode
RAK4631.upload.maximum_size=40832
RAK4631.upload.maximum_data_size=8192


RAK3172P.name=RAK3172P RTDuo

RAK3172P.build.board=RAK3172P
RAK3172P.build.core=rak3172p
RAK3172P.build.variant=RAK5005O
RAK3172P.build.mcu=cortex-m4
RAK3172P.build.f_cpu=48000000L
RAK3172P.build.arch=STM32WL

RAK3172P.upload.tool=ymodem_upload
RAK3172P.upload.speed=115200
RAK3172P.program.tool=ymodem_upload
RAK3172P.program.speed=115200
RAK3172P.bootloader.tool=rtduo_vscode
RAK3172P.upload.maximum_size=40832
RAK3172P.upload.maximum_data_size=4096

RAK3172T.name=RAK3172T RTDuo

RAK3172T.build.board=RAK3172T
RAK3172T.build.core=rak3172t
RAK3172T.build.variant=RAK5005O
RAK3172T.build.mcu=cortex-m4
RAK3172T.build.f_cpu=48000000L
RAK3172T.build.arch=STM32WL

RAK3172T.upload.tool=ymodem_upload
RAK3172T.upload.speed=115200
RAK3172T.program.tool=ymodem_upload
RAK3172T.program.speed=115200
RAK3172T.bootloader.tool=rtduo_vscode
RAK3172T.upload.maximum_size=40832
RAK3172T.upload.maximum_data_size=4096

RAK11720.name=RAK11720 RTDuo

RAK11720.build.board=RAK11720
RAK11720.build.core=rak11720
RAK11720.build.variant=RAK5005O
RAK11720.build.mcu=cortex-m4
RAK11720.build.f_cpu=48000000L
RAK11720.build.arch=APOLLO3

RAK11720.upload.tool=ymodem_upload
RAK11720.upload.speed=115200
RAK11720.program.tool=ymodem_upload
RAK11720.program.speed=115200
RAK11720.bootloader.tool=rtduo_vscode
RAK11720.upload.maximum_size=40832
RAK11720.upload.maximum_data_size=8192

RAK4200.name=RAK4200 RTDuo

RAK4200.build.board=RAK4200
RAK4200.build.core=rak4200
RAK4200.build.variant=RAK5005O
RAK4200.build.mcu=cortex-m0plus
RAK4200.build.f_cpu=32000000L
RAK4200.build.arch=STM32L0

RAK4200.upload.tool=ymodem_upload
RAK4200.upload.speed=115200
RAK4200.program.tool=ymodem_upload
RAK4200.program.speed=115200
RAK4200.bootloader.tool=rtduo_vscode
RAK4200.upload.maximum_size=16256
RAK4200.upload.maximum_data_size=1024
